<?php
    $names_abonents = array( "Абонент", "Тип абонента", "Фамилия, имя, отчество", "Адрес регистрации или Юридический адрес", "Фактический адрес", "Электронная почта", "Телефон(ы)", "ИНН", "КПП", "ОГРН", "Дата рождения","Должность руководителя", "ФИО руководителя компании", "Расчетный счет", "Банк", "БИК", "Корр. счет", "Согласие на обработку персональных данных" );
    
    $names_account_users = array( "Пользователь", "Лицевой счет", "Одобрен (активен)", "Режим доступа" );

    $names_accounts_query = array( "Запрос", "Данные запроса (лицевой счет, комментарий)", "Пользователь", "Управляющая компания", "Объект недвижимости", "Дата запроса", "Статус запроса", "Причина отказа" );
    
    $names_bots = array( "ID", "Тип", "Идентификатор бота", "Наименование бота", "Выданный токен" );
	
    $names_users = array( "Пользователь", "Логин", "Пароль", "Фамилия, имя, отчество", "Пол", "Электронная почта", "Согласие на получение уведомлений по электронной почте", "Телефон(ы)", "Согласие на получение SMS уведомлений", "Тип обращения", "Обращение", "Комментарий", "Согласие на обработку персональных данных", "Бот социальной сети", "Пользователь социальной сети", "Согласие на получение уведомлений в социальных сетях", "Дата регистрации" );
    
    $names_users_query = array( "Запрос", "Логин", "Пароль", "Фамилия, имя, отчество", "Пол", "Электронная почта", "Согласие на получение уведомлений по электронной почте", "Телефон(ы)", "Согласие на получение SMS уведомлений", "Тип обращения", "Обращение", "Комментарий", "Согласие на обработку персональных данных", "Бот социальной сети", "Пользователь социальной сети", "Согласие на получение уведомлений в социальных сетях", "Дата запроса" );
  


    $names_account_devices=array ("Лицевой счет","Коммунальная услуга","Вид тарифа","Прибор учета","Дата начала действия","	Используется");
    
    
    $names_account_normatives = array("Лицевой счет","Коммунальная услуга","Вид тарифа","Дата начала действия","Показатель расчета по нормативам","Используется");
    
    $names_account_services = array ("Лицевой счет","Коммунальная услуга","Вид тарифа","Вид расчета","Дата начала действия","Используется","Доля","Дополнительный коэффициент");
    
    $names_admins = array("ID","Логин","Пароль","Управляющая компания","Имя пользователя","Электронная почта","Телефон(ы)","Комментарий");
    
    $names_commondevices = array ("Объект недвижимости","Коммунальная услуга","	Вид тарифа","Прибор учета","Дата начала действия","Используется");

	$names_contractors = array ("Наименование", "Юридический адрес", "Фактический адрес", "Электронная почта", "Телефон(ы)", "ИНН", "КПП", "ОГРН", "Должность руководителя","ФИО руководителя","Расчетный счет","Банк","БИК","Корр. счет","Регион");
	
	$names_devices_event = array("Прибор учета","Тип события","Дата события","Показания на дату события",
	"Используется");
	
	$names_devices_indications = array ("Прибор учета","Дата фиксации показания прибора учета", "Показания прибора учета");
	
	
	$names_devices = array("Прибор учета","Наименование прибора учета или заводской номер","Дата выпуска","Начальные показания","Модель прибора учета","Дата следующей поверки");
	
	$names_devices_model = array ("Модель приборов учета","Наименование модели", "Межповерочный интервал, мес.","	Производитель");
	
	$names_global_admins = array ("ID","Логин","Пароль","Имя","Почта","Телефон","Коментарий");
	
	$names_managementCompany = array ("Краткое наименование управляющей компании","Полное наименование управляющей компании","	Юридический адрес","Фактический адрес","Электронная почта","Телефон(ы)","ИНН","КПП","ОГРН","Должность руководителя","ФИО руководителя","Расчетный счет","Банк","БИК","Корр. счет","Регион");
	
	$names_objects = array("Наименование объекта недвижимости","Кадастровый номер", "Родитель", "Тип объекта","Площадь объекта недвижимости","Адрес объекта недвижимости","Комментарий","Управляющая компания");
	
	
	$names_models_functions = array ("Наименование модели","Виды тарифов" ,"Использование");
	


	
	$names_services = array ("Коммунальная услуга","Наименование", "Поставщик коммунальной услуги","Управляющая компания","Составная ","Входит в состав услуги","Единица измерения","Печатать в платежках");
	
	
	
	$names_personal_account = array ("Лицевой счет","Номер лицевого счета","Управляющая компания","Абонент","Объект недвижимости","Дата начала действия","Дата окончания действия","Используется (активен)");
	
	$names_regions = array("Регион","Наименование");
	
	$names_tariffs = array ("Вид тарифа","Коммунальная услуга","Регион","Управляющая компания","Дата начала действия", "Цена, руб.");
	
	$names_tariff_types = array("Вид тарифа","Наименование","Является нормативом");
	
	$names_unit = array("Идентификатор единицы измерения", "Наименование");

	$names_ar = array(
	"AccountUsers" => $names_account_users,
	"AccountServices" =>$names_account_services,
	"AccountNormatives" =>$names_account_normatives,
	"AccountDevices" =>$names_account_devices,
	"Abonents" =>$names_abonents,
	"AccountsQuery" =>$names_accounts_query,
	"Admins"=>$names_admins,
	"Bots" => $names_bots,
	"CommonDevices" => $names_commondevices,
	"Contractors" => $names_contractors,
	"Devices" => $names_devices,
	"DeviceEvents"=>$names_devices_event, 
	"GlobalAdmins" => $names_global_admins,
	"ModelFunctions"=>$names_models_functions,
	"ManagementCompany" => $names_managementCompany,
	"Objects" => $names_objects,
	"DeviceIndications"=> $names_devices_indications,
	"DeviceModels" =>$names_devices_model, 
	"Services" => $names_services,
	"PersonalAccounts" => $names_personal_account,
	"Regions" => $names_regions,
	"Tariffs" => $names_tariffs,
	"TariffTypes" => $names_tariff_types,
	"Units" => $names_unit,
	"Users" => $names_users,
	"UsersQuery" =>$names_users_query );
?>